---
  - name: "sum"
    command: "a = 1 + 1"
    result: "[a+i for i in range(10)]"
    exp: 8
    assert_op: ">"
    assert_itr: "any"

  - name: "diff"
    command: "a = 1 - 1"
    result: a
    exp: -1
    assert_op: "<"

  - name: "product"
    command: "a = 2 * 2"
    result: "[a*i for i in range(4)]"
    exp: 4
    assert_op: ">="
    assert_itr: "all"

  - name: "division"
    command: "a = 1 / 2"
    result: a
    exp: 0.5
    assert_op: "<="
  
  - name: "ZeroDivision"
    hint: This demonstrates Device Exception
    command: "a = 1 / 0"

